api/app/controllers/api/v1/art_movements_controller.rb

      def index
        @art_movements = ArtMovement.all
---
SELECT "art_movements".* FROM "art_movements"

      def set_art_movement
        @art_movement = ArtMovement.find(params[:id])
---
SELECT "art_movements".* FROM "art_movements" WHERE "art_movements"."id" = 2 LIMIT 1