api/app/controllers/api/v1/artists_controller.rb

SELECT "art_movements".* FROM "art_movements" WHERE "art_movements"."id" IN (1, 2, 3, 4, 5)
SELECT "artists".* FROM "artists"
---
      def index
        @artists = Artist.includes(artworks: :art_movement).all

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = 6
---
      def update
        if @artist.update(artist_params)
          render json: { artist: @artist, artworks: @artist.artworks.includes(:art_movement) }