api/app/controllers/api/v1/artworks_controller.rb

SELECT "art_movements".* FROM "art_movements" WHERE "art_movements"."id" IN (1, 2, 3)
SELECT "artists".* FROM "artists" WHERE "artists"."id" IN (1, 2, 3)
SELECT "artworks".* FROM "artworks"
---
      def index
        @artworks = Artwork.includes(:artist, :art_movement).all

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = 6 LIMIT 1
SELECT "artists".* FROM "artists" WHERE "artists"."id" = 7 LIMIT 1
SELECT "art_movements".* FROM "art_movements" WHERE "art_movements"."id" = 5 LIMIT 1
---
      def related_artworks
        @artwork = Artwork.find(params[:id])
        recommendations = ArtworkRecommendationService.find_recommendations(@artwork, :artist)
        recommendations += ArtworkRecommendationService.find_recommendations(@artwork, :movement)

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = 6 LIMIT 1
---
      def set_artwork
        @artwork = Artwork.find(params[:id])