api/app/controllers/api/v1/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE ("artworks"."artist_id" = 6 OR "artworks"."art_movement_id" = 5) AND "artworks"."id" != 6
---
      def related_artworks
        @artwork = Artwork.find(params[:id])
        related_artworks = (Artwork.where(artist_id: @artwork.artist_id).or(Artwork.where(art_movement_id: @artwork.art_movement_id))).where.not(id: @artwork.id)